<?php

/**
 * 习惯模块接口响应错误信息
 * @author mengrui
 * $Id: response_message.php $
 */

/**
 * 错误码定义规则
 * 取值范围：[1003000,1003499]
 * 前三位：100（voice-note-service项目标识）
 * 第四位：3（内容模块标识）
 * 后三位：[0,499]（可定义500个不重复的错误码）
 */
return [
    1003000  => '长度过长',
    1003001  => '开关启用状态值错误',
    1003002  => 'remind_time 格式错误',
    1003003  => '频率配置项，必须为正整数',
    1003004  => '间隔单位仅支持 daily, weekly, monthly, interval',
    1003005  => '频率配置项，不能为空',
    1003006  => '频率配置项，必须为1～7之间的数字',
    1003007  => '频率配置项，必须为正整数',
    1003008  => '您启用习惯，已达上限，请先停用或删除部分习惯后再添加',
    1003009  => '习惯添加失败，请重试',
    1003010  => '数据获取失败',
    1003011  => '习惯不存在或无权限',

];
