<?php

/**
 * 笔记模块日志错误码信息
 * @author mengrui
 * $Id: log_message.php $
 */

/**
 * 错误码定义规则
 * 取值范围：[1003500,1003999]
 * 前三位：100（voice-note-service项目标识）
 * 第四位：3（笔记模块标识）
 * 后三位：[500,999]（可定义500个不重复的错误码）
 */

return [
    1003500 => '数据异常',
    1003501 => '音频文件大小超过限制',
    1003502 => '不支持的音频文件类型',
    1003503 => '非法音频文件',
    1003504 => '音频时长超出限制',
    1003505 => 'VOLC ASR task 处理中/排队中',
    1003506 => 'VOLC ASR task timeout',
    1003507 => 'VOLC ASR Query error',
    1003508 => '数据异常',
    1003509 => '数据异常',
];