<?php

/**
 * 公共日志错误码信息
 * @author mr
 * $Id: log_message.php $
 */

/**
 * 错误码定义规则
 * 取值范围：[1000500,1000999]
 * 前三位：100（voice-note-service项目标识）
 * 第四位：0（公共标识）
 * 后三位：[500,999]（可定义500个不重复的错误码）
 */

return [
    9040500 => '',
    9040501 => '',
    9040502 => 'http_code_error',
    9040503 => 'curl_error',
    9040504 => '接口响应数据json解析失败',
    9040505 => '配置中心自定义组配置不存在',
    9040506 => '配置中心服务配置项urls不存在',
    9040507 => '配置中心服务配置项domain不存在',
    9040508 => '配置中心服务配置项timeout不存在',
    9040509 => '配置中心服务配置项urls数据解析失败',
    9040510 => 'redis操作返回错误',
    9040511 => 'redis操作异常',
    9040512 => '接口响应数据字段异常',
    9040513 => '接口响应未知错误',
    9040514 => '发送验证码请求超时',
    9040515 => '发送验证码请求失败',
    9040516 => '发送验证码响应数据异常',
    9040517 => '获取userkey请求超时',
    9040518 => '获取userkey请求失败',
    9040519 => '获取userkey响应数据异常',
    9040520 => '根据家长获取孩子信息请求超时',
    9040521 => '根据家长获取孩子信息请求失败',
    9040522 => '根据家长获取孩子信息响应数据异常',
    9040523 => 'zookeeper配置key未设置',
    9040524 => 'amqp推送消息异常',
    9040525 => '记录redis操作'
];
