<?php

/**
 * 公共日志错误码信息
 * @author mr
 * $Id: log_message.php $
 */

/**
 * 错误码定义规则
 * 取值范围：[1000500,1000999]
 * 前三位：100（voice-note-service项目标识）
 * 第四位：0（公共标识）
 * 后三位：[500,999]（可定义500个不重复的错误码）
 */

return [
    1000500 => '',
    1000501 => '',
    1000502 => 'http_code_error',
    1000503 => 'curl_error',
    1000504 => '接口响应数据json解析失败',
    1000505 => '配置中心自定义组配置不存在',
    1000506 => '配置中心服务配置项urls不存在',
    1000507 => '配置中心服务配置项domain不存在',
    1000508 => '配置中心服务配置项timeout不存在',
    1000509 => '配置中心服务配置项urls数据解析失败',
    1000510 => 'redis操作返回错误',
    1000511 => 'redis操作异常',
    1000512 => '接口响应数据字段异常',
    1000513 => '接口响应未知错误',
    1000514 => '发送验证码请求超时',
    1000515 => '发送验证码请求失败',
    1000516 => '发送验证码响应数据异常',
    1000517 => '获取userkey请求超时',
    1000518 => '获取userkey请求失败',
    1000519 => '获取userkey响应数据异常',
    1000520 => '根据家长获取孩子信息请求超时',
    1000521 => '根据家长获取孩子信息请求失败',
    1000522 => '根据家长获取孩子信息响应数据异常',
    1000523 => 'zookeeper配置key未设置',
    1000524 => 'amqp推送消息异常',
    1000525 => '记录redis操作'
];
