<?php

/**
 * 公共接口响应错误信息
 * $Id: response_message.php $
 * @author mengrui
 */

/**
 * 错误码定义规则
 * 取值范围：[1001000,1001499]
 * 前三位：100（voice-note-service项目标识）
 * 第四位：1（公共模块标识）
 * 后三位：[0,499]（可定义500个不重复的错误码）
 */

define('GLOBAL_NETWORK_EXCEPTION', ['网络不给力']);
define('OPERATE_SUCCESS', ['操作成功']);

return [
    0       => [
        'message' => 'success',
        'desc' => [
            'code' => OPERATE_SUCCESS,
        ],
    ],
    1001000 => '缺少参数',
    1001001 => '参数值非法',
    1001002 => '数据库查询失败',
    1001003 => '未登录',
    1001004 => '数据不存在',
    1001005 => [
        'message' => '接口网络请求失败',
        'desc' => ['default' => GLOBAL_NETWORK_EXCEPTION],
    ],
    1001006 => [
        'message' => '接口响应数据异常',
        'desc' => ['default' => GLOBAL_NETWORK_EXCEPTION],
    ],
    1001007 => '调用内部方法参数错误',
    1001008 => '用户已注销',
    1001009 => '用户已登出',
    1001010 => '未知错误',
    1001011 => '接口响应错误',
    1001012 => '账号不存在',
    1001013 => '',
    1001014 => '数据存储失败',
    1001015 => '提交失败，内容涉嫌违规',
    1001016 => '',
    1001017 => '',
    1001018 => '',

];
